#+title: notebook.org

* Setup
#+begin_src bash
  python3 -m venv .venv
#+end_src

#+begin_src bash
  .venv/bin/pip install kagglehub
  .venv/bin/pip install learntools
  .venv/bin/pip install google-cloud-bigquery
  .venv/bin/pip install db-dtypes
  .venv/bin/pip install pyarrow
#+end_src

* USA Names
#+begin_src python :python ".venv/bin/python" :results output
  from google.cloud import bigquery

  # Construct a BigQuery client object.
  client = bigquery.Client()

  query = """
      SELECT name, SUM(number) as total_people
      FROM `bigquery-public-data.usa_names.usa_1910_2013`
      WHERE state = 'TX'
      GROUP BY name, state
      ORDER BY total_people DESC
      LIMIT 20
  ;"""
  rows = client.query_and_wait(query)  # Make an API request.

  print("The query data:")
  for row in rows:
      # Row values can be accessed by field name or index.
      print("name={}, count={}".format(row[0], row["total_people"]))
#+end_src

#+RESULTS:
#+begin_example
The query data:
name=James, count=272793
name=John, count=235139
name=Michael, count=225320
name=Robert, count=220399
name=David, count=219028
name=Mary, count=209893
name=William, count=173092
name=Jose, count=157362
name=Christopher, count=144196
name=Maria, count=131056
name=Charles, count=126509
name=Daniel, count=117470
name=Richard, count=109888
name=Juan, count=109808
name=Jennifer, count=98696
name=Joshua, count=90679
name=Elizabeth, count=90465
name=Joseph, count=89097
name=Matthew, count=88464
name=Joe, count=87977
#+end_example

* PYTHON
:PROPERTIES:
:header-args:python: :session *Python*
:header-args:python+: :results output
:header-args:python+: :python ".venv/bin/python3"
:END:
#+begin_src python
  from google.cloud import bigquery

  client = bigquery.Client()
  print(client.project)
#+end_src

#+RESULTS:
: edu-analytics-orgmode
#+begin_src python
  print(client.project)
#+end_src

#+RESULTS:
: edu-analytics-orgmode

** Linear Regression
#+begin_src python
  """Create a Google BigQuery linear regression input table.

  In the code below, the following actions are taken:
  ,* A new dataset is created "natality_regression."
  ,* A query is run against the public dataset,
      bigquery-public-data.samples.natality, selecting only the data of
      interest to the regression, the output of which is stored in a new
      "regression_input" table.
  ,* The output table is moved over the wire to the user's default project via
      the built-in BigQuery Connector for Spark that bridges BigQuery and
      Cloud Dataproc.
  """

  # Prepare a reference to a new dataset for storing the query results.
  dataset_id = "natality_regression";
  dataset_id_full = f"{client.project}.{dataset_id}"

  dataset = bigquery.Dataset(dataset_id_full)

  # Create the new BigQuery dataset.
  #dataset = client.create_dataset(dataset)

  # Configure the query job.
  job_config = bigquery.QueryJobConfig()

  # Set the destination table to where you want to store query results.
  # As of google-cloud-bigquery 1.11.0, a fully qualified table ID can be
  # used in place of a TableReference.
  #job_config.destination = f"{dataset_id_full}.regression_input"

  # Set up a query in Standard SQL, which is the default for the BigQuery
  # Python client library.
  # The query selects the fields of interest.
  query = """
      SELECT
          weight_pounds, mother_age, father_age, gestation_weeks,
          weight_gain_pounds, apgar_5min
      FROM
          `bigquery-public-data.samples.natality`
      WHERE
          weight_pounds IS NOT NULL
          AND mother_age IS NOT NULL
          AND father_age IS NOT NULL
          AND gestation_weeks IS NOT NULL
          AND weight_gain_pounds IS NOT NULL
          AND apgar_5min IS NOT NULL
  ;"""

  # Run the query.
  client.query_and_wait(query, job_config=job_config)  # Waits for the query to finish

  for row in rows:
      print("weight={}, mother_age={}".format(row[0], row["mother_age"]))
#+end_src

#+RESULTS:

* No Session
#+begin_src python :python ".venv/bin/python3" :results output
  from google.cloud import bigquery

  client = bigquery.Client()
  print(client.project)
#+end_src

#+RESULTS:
: edu-analytics-orgmode

#+begin_src python :session *Python*
  print(client.project)
#+end_src
#+RESULTS:
: None
#+RESULTS:
#+begin_src python :python ".venv/bin/python" :results output
  from google.cloud import bigquery

  client = bigquery.Client()

  # Perform a query.
  QUERY = """
  SELECT country_region
  FROM `bigquery-public-data.covid19_google_mobility.mobility_report`
  LIMIT 1000;"""

  query_job = client.query(QUERY)  # API request
  rows = query_job.result()  # Waits for query to finish

  for row in rows:
      print(row.country_region)
#+end_src
#+RESULTS:
#+begin_example
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
Portugal
#+end_example

** client is not defined. :session must not be working. Setting the session header argument in the heading property drawer should have worked.

* Kaggle
#+begin_src bash
  export KAGGLE_API_TOKEN=KGAT_616ba9ea04917848ead4c28c82484635
#+end_src

#+begin_src python
  from learntools.learntools.core import binder
#+end_src

#+RESULTS:

#+begin_src python
  import kagglehub
  from learntools.core import binder
  binder.bind(globals())
  from learntools.sql_advanced.ex1 import *
  print("Setup Complete")
#+end_src

#+RESULTS:



#+RESULTS:

#+begin_src bash
  kaggle competitions list
#+end_src

#+RESULTS:
